import React from 'react';
import {Menu} from '../menu/menu';
import {Logo} from '../logo/logo';
import {Social} from '../social/social';

const Footer = () => {
    return (
        <footer className="footer">
            <div className="footer__wrapper wrapper">
                <div className="footer__left">
                    <div className="footer__address">
                        <Logo className="footer__logo"/>
                        <p className="footer__desk">
                            150015, г.&nbsp;Москва, ул.&nbsp;Московская,&nbsp;д.&nbsp;32
                            Генеральная&nbsp;лицензия Банка&nbsp;России&nbsp;№1050
                            Ⓒ&nbsp;Лига&nbsp;Банк, 2021
                        </p>
                    </div>
                    <Menu className="footer__menu menu--column"/>
                </div>
                <div className="footer__right">
                    <div className="footer__mobile">
                        <svg className="footer__mobile-icon" width="10" height="16" viewBox="0 0 10 16" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M8.8373 0H1.1627C0.523313 0 0 0.485943 0 1.08069V14.9189C0 15.5136 0.523313 16 1.1627 16H8.8373C9.47669 16 10 15.5145 10 14.9193V1.08069C10 0.485943 9.47669 0 8.8373 0ZM3.77238 0.778971H6.22762C6.30533 0.778971 6.36829 0.837486 6.36829 0.910171C6.36829 0.9824 6.30533 1.04091 6.22762 1.04091H3.77238C3.69467 1.04091 3.63171 0.9824 3.63171 0.910171C3.63171 0.837486 3.69467 0.778971 3.77238 0.778971ZM5 15.4597C4.67883 15.4597 4.41865 15.2178 4.41865 14.9189C4.41865 14.6199 4.67883 14.3785 5 14.3785C5.32117 14.3785 5.58135 14.6199 5.58135 14.9189C5.58135 15.2178 5.32117 15.4597 5 15.4597ZM9.19093 14H0.809069V1.71383H9.19093V14Z"
                                fill="#1F1E25"/>
                        </svg>
                        <a href="tel:0904" className="footer__tel">*0904</a>
                        <p className="footer__desk">Бесплатно для&nbsp;абонентов МТС, Билайн, Мегафон, Теле2</p>
                    </div>
                    <div className="footer__telephone">
                        <svg className="footer__telephone-icon" width="10" height="16" viewBox="0 0 16 16" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M15.9991 11.9282V15.0712C15.9992 15.2962 15.914 15.5129 15.7605 15.6775C15.6071 15.8422 15.397 15.9425 15.1725 15.9582C14.7841 15.9849 14.4668 15.9991 14.2214 15.9991C6.36676 15.9991 0 9.63235 0 1.77768C0 1.53236 0.0133326 1.21504 0.0408866 0.826621C0.056639 0.602139 0.156952 0.391988 0.321585 0.238572C0.486218 0.0851569 0.702915 -0.000101713 0.927949 2.28058e-07H4.07089C4.18114 -0.000111402 4.28749 0.0407613 4.36929 0.114678C4.4511 0.188596 4.5025 0.29028 4.51353 0.399978C4.53397 0.604411 4.55264 0.767069 4.57041 0.890617C4.74706 2.12337 5.10905 3.32233 5.64413 4.44687C5.72857 4.62463 5.67346 4.83706 5.51347 4.95084L3.59536 6.32143C4.76814 9.05412 6.94588 11.2319 9.67857 12.4046L11.0474 10.4901C11.1033 10.4119 11.185 10.3558 11.278 10.3316C11.3711 10.3074 11.4697 10.3166 11.5567 10.3576C12.6811 10.8917 13.8797 11.2528 15.1121 11.4287C15.2356 11.4465 15.3983 11.466 15.6009 11.4856C15.7105 11.4968 15.8119 11.5483 15.8857 11.6301C15.9594 11.7119 16.0001 11.8181 16 11.9282H15.9991Z"
                                fill="#1F1E25"/>
                        </svg>
                        <a href="tel:88001112233" className="footer__tel">8 800 111 22 33</a>
                        <p className="footer__desk">Бесплатный для&nbsp;всех городов России</p>
                    </div>
                    <Social className="footer__social"/>
                </div>
            </div>
        </footer>
    );
};

export {Footer};
